app/views/admin/product/_form.html.erb

SELECT `tags`.* FROM `tags`
---
		<label for="tags">Tags</label><br/>
		<input type="text" id="tags" autocomplete="off" size="50" name="tags" value="<%= @product.tags.collect{|tag| tag.name }.join(", ") if @product.tags -%>">

SELECT `suppliers`.* FROM `suppliers` INNER JOIN `products_suppliers` ON `suppliers`.`id` = `products_suppliers`.`supplier_id` WHERE `products_suppliers`.`product_id` = 980190962
---
  <p><label for="product[supplier_ids][]">Proveedores</label><br/>
  <%= select_tag 'product[supplier_ids][]', options_from_collection_for_select(@suppliers, :id, :name,
      @product.suppliers.collect{|supplier| supplier.id}), { :multiple => true, :size => 5 } %></p>