app/controllers/admin/brand_controller.rb

  def create
    @brand = Brand.new(params[:brand])
    if @brand.save
---
INSERT INTO `brands` (`city`, `created_at`, `name`, `phone`, `province`, `street`, `updated_at`) VALUES ('Ciudad Jamona', '2014-04-17 11:16:59', 'Navidul', '123456789', 'Provincia Jamona', 'Calle Jamona', '2014-04-17 11:16:59')

  def edit
    @brand = Brand.find(params[:id])
---
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 980190962 LIMIT 1

  def update
    @brand = Brand.find(params[:id])
    if @brand.update_attributes(params[:brand])
---
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 980190962 LIMIT 1
UPDATE `brands` SET `name` = 'Joseph', `updated_at` = '2014-04-17 11:16:59' WHERE `brands`.`id` = 980190962

  def destroy
    @brand = Brand.find(params[:id])
    flash[:notice] = "La marca #{@brand.name} ha sido borrada."
    @brand.destroy
---
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 980190962 LIMIT 1
DELETE FROM `brands` WHERE `brands`.`id` = 980190962

  def show
    @brand = Brand.find(params[:id])
---
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 980190962 LIMIT 1

  def index
    @brands = Brand.all
---
SELECT `brands`.* FROM `brands`