app/controllers/admin/order_controller.rb

SELECT `orders`.* FROM `orders` LIMIT 10 OFFSET 0
---
  def index
  	@status = params[:id]
    if @status.blank?
      @status = 'all'
      conditions = nil
      @page_title = "Lista de todos los pedidos"
    else
      conditions = "status = '#{@status}'"
      estado = case @status
        when "open" then "abiertos"
        when "processed" then "procesados"
        when "closed" then "cerrados"
        when "failed" then "fallidos"
      end
      @page_title = "Lista de pedidos #{estado}"
    end
    sort_by = params[:sort_by]
    @orders = Order.paginate :page => params[:page], :conditions => conditions,
              :per_page => 10, :order => sort_by

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
  def close
    order = Order.find(params[:id])