app/controllers/admin/product_controller.rb

  def create
    @product = Product.new(params[:product])
		@product.tag_list.add(params[:tags], parse: true)
    if @product.save
---
INSERT INTO `products` (`brand_id`, `cover_image_content_type`, `cover_image_file_name`, `cover_image_file_size`, `cover_image_updated_at`, `created_at`, `description`, `name`, `origin`, `price`, `type`, `updated_at`, `weight`) VALUES (980190962, NULL, NULL, NULL, NULL, '2014-04-17 11:17:00', 'A great ham', 'Jamon iberico', 'Extremadura', 45.5, NULL, '2014-04-17 11:17:00', 3.75)
INSERT INTO `tags` (`name`, `taggings_count`) VALUES ('Tag1', 0)

  def edit
    load_data
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1

  def update
    @product = Product.find(params[:id])
    @product.tag_list.remove(@product.tag_list.split(","), parse: true);
    @product.tag_list.add(params[:tags], parse: true)
    if @product.update_attributes(params[:product])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
UPDATE `products` SET `name` = 'Producto 2', `type` = 'Tipo 2', `description` = 'Descripcion producto 2', `origin` = 'Origen producto 2', `price` = 13.0, `weight` = 2.5, `updated_at` = '2014-04-23 18:56:12' WHERE `products`.`id` = 1
UPDATE `tags` SET `taggings_count` = COALESCE(`taggings_count`, 0) - 1 WHERE `tags`.`id` = 980190963

  def destroy
    @product = Product.find(params[:id])
    flash[:notice] = "El producto #{@product.name} ha sido borrado."
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 980190962

  def index
    sort_by = params[:sort_by]
    @products = Product.paginate :page => params[:page], :order => sort_by, :per_page => 5
---
SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` LIMIT 5 OFFSET 0

  def load_data
    @suppliers = Supplier.find(:all)
    @brands = Brand.find(:all)
		@tags = Tag.find(:all)
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 980190962 LIMIT 1
SELECT `brands`.* FROM `brands` WHERE `brands`.`id` = 980190962 LIMIT 1
SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('tag1') OR LOWER(name) = LOWER('tag2') OR LOWER(name) = LOWER('tag3'))