app/controllers/admin/supplier_controller.rb

  def create
    @supplier = Supplier.new(params[:supplier])
    if @supplier.save
---
INSERT INTO `suppliers` (`city`, `created_at`, `name`, `phone`, `province`, `street`, `updated_at`) VALUES ('Ciudad Jamona', '2014-04-17 11:17:00', 'Navidul', '123456789', 'Provincia Jamona', 'Calle Jamona', '2014-04-17 11:17:00')

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 980190962 LIMIT 1

  def update
    @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(params[:supplier])
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 980190962 LIMIT 1
UPDATE `suppliers` SET `name` = 'Joseph', `updated_at` = '2014-04-17 11:17:01' WHERE `suppliers`.`id` = 980190962

  def destroy
    @supplier = Supplier.find(params[:id])
    flash[:notice] = "El proveedor #{@supplier.name} ha sido borrado."
    @supplier.destroy
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 980190962 LIMIT 1
DELETE FROM `suppliers` WHERE `suppliers`.`id` = 980190962

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 980190962 LIMIT 1

  def index
    @suppliers = Supplier.all
---
SELECT `suppliers`.* FROM `suppliers`