app/controllers/cart_controller.rb

  def add
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1

  def remove
    @product = Product.find(params[:id])
    @page_title = 'Eliminar ítem'
    if request.xhr?
      @item = @cart.remove(params[:id])
      flash.now[:cart_notice] = "<em>#{@item.product.name}</em> producto eliminado".html_safe
      render :controller => 'cart', :action => 'remove_with_ajax'
    elsif request.post?
      if @cart.cart_items.find_by_product_id(params[:id].to_i).amount - params[:amount].to_i >= 0
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 5 AND `cart_items`.`product_id` = 4 LIMIT 1

  def clear
    @page_title = 'Vaciar carrito'
    if request.xhr?
      @cart.cart_items.destroy_all
---
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 3