app/controllers/catalog_controller.rb

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` ORDER BY products.id desc LIMIT 10 OFFSET 0
SELECT `suppliers`.*, `t0`.`product_id` AS ar_association_key_name FROM `suppliers` INNER JOIN `products_suppliers` `t0` ON `suppliers`.`id` = `t0`.`supplier_id` WHERE `t0`.`product_id` IN (20, 19, 18, 17, 16, 15, 14, 13, 12, 11)
---
  def index
  	@page_title = "Lista de productos"
  	@products = Product.paginate :page => params[:page],
								 :per_page => 10,
								 :include => [:brand, :suppliers],
								 :order => "products.id desc"

SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
---
  def show
    unless @product = Product.find_by_id(params[:id])

SELECT `products`.* FROM `products` WHERE (`products`.`name` LIKE '%Producto 15%')
---
  def search
    @page_title = "Buscar producto"
    if params[:q] && params[:q] != ""
      @products = Product.where("name LIKE ?", "%#{params[:q]}%")