app/controllers/checkout_controller.rb

SELECT COUNT(*) FROM `products` INNER JOIN `cart_items` ON `products`.`id` = `cart_items`.`product_id` WHERE `cart_items`.`cart_id` = 9
---
  def index
  	@order = Order.new
  	@page_title = "Checkout"
  	if @cart.products.empty?

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 12 LIMIT 1
INSERT INTO `orders` (`created_at`, `customer_ip`, `email`, `error_message`, `phone_number`, `ship_to_address`, `ship_to_city`, `ship_to_country_code`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_postal_code`, `status`, `updated_at`) VALUES ('2014-05-19 15:47:16', '127.0.0.1', 'email@email.com', NULL, '666112233', 'Address', 'City', 'Country', 'Firstname', 'Lastname', '00000', 'open', '2014-05-19 15:47:16')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 7
---
  def submit_order
    @cart = Cart.find(params[:cart][:id])
    @order = Order.new(params[:order])
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = "Checkout"
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = "Tu pedido se ha enviado, y se procesará inmediatamente."
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all