app/controllers/tag_controller.rb

  def list
		@page_title = 'Lista de tags'
    @tags = Tag.paginate :page => params[:page], :order => :name, :per_page => 5
---
SELECT `tags`.* FROM `tags` ORDER BY name LIMIT 5 OFFSET 0